"""

 Чтобы в Pycharm Создать SQL file: Создает текстовый файл с расширением .sql или .SQL

 # Регулярки в SQL

 SELECT ... WHERE title REGEXP BINARY '^(An?|The) +'; -- MySQL

 SELECT ... WHERE REGEXP_LIKE(title, '^(An?|The) +', 'c'); -- Oracle

 SELECT ... WHERE title ~ '^(An?|The) +'; -- PostgreSQL

 SELECT ... WHERE title REGEXP '^(An?|The) +'; -- SQLite


 Создание таблицы book со столбцами определенного типа данных

 CREATE TABLE book(
    book_id INT PRIMARY KEY AUTO_INCREMENT,    # id  pk primary key
    title VARCHAR(50),                         # str
    author VARCHAR(30),                        # str
    price DECIMAL(8, 2),                       # decimal
    amount INT                                 # int
);

 # Вставка записи в таблицу
 INSERT INTO book (book_id,	title,	author,	price,	amount)             # Столбцы
 VALUES
    ('1', 'Мастер и Маргарита','Булгаков М.А.','670.99', '3');          # Значения

 +---------+--------------------+---------------+--------+--------+
 | book_id | title              | author        | price  | amount |
 +---------+--------------------+---------------+--------+--------+
 | 1       | Мастер и Маргарита | Булгаков М.А. | 670.99 | 3      |
 +---------+--------------------+---------------+--------+--------+


 # Занесите три последние записи в таблицу book,  первая запись уже добавлена на предыдущем шаге:

 INSERT INTO book (title, author, price, amount)
 VALUES
     ('Белая гвардия', 'Булгаков М.А.', 540.50 , 5),
     ('Идиот', 'Достоевский Ф.М.', 460, 10),
     ('Братья Карамазовы', 'Достоевский Ф.М.', 799.01, 2),
     ('Стихотворения и поэмы', 'Есенин С.А.', 650.00, 15);


 # Исходная таблица
 +---------+-----------------------+------------------+--------+--------+
 | book_id | title                 | author           | price  | amount |
 +---------+-----------------------+------------------+--------+--------+
 | 1       | Мастер и Маргарита    | Булгаков М.А.    | 670.99 | 3      |
 | 2       | Белая гвардия         | Булгаков М.А.    | 540.50 | 5      |
 | 3       | Идиот                 | Достоевский Ф.М. | 460.00 | 10     |
 | 4       | Братья Карамазовы     | Достоевский Ф.М. | 799.01 | 2      |
 | 5       | Стихотворения и поэмы | Есенин С.А.      | 650.00 | 15     |
 +---------+-----------------------+------------------+--------+--------+


 # Мы выбираем столбцы title, author, amount из Таблицы book
 SELECT title, author, amount  FROM book

 # Тоже самое
 SELECT (title), (author), (amount)  FROM book

 # Выбрать все поля из Таблицы book
 SELECT * FROM book

 +-----------------------+------------------+--------+
 | title                 | author           | amount |
 +-----------------------+------------------+--------+
 | Мастер и Маргарита    | Булгаков М.А.    | 3      |
 | Белая гвардия         | Булгаков М.А.    | 5      |
 | Идиот                 | Достоевский Ф.М. | 10     |
 | Братья Карамазовы     | Достоевский Ф.М. | 2      |
 | Стихотворения и поэмы | Есенин С.А.      | 15     |
 +-----------------------+------------------+--------+

 # AS дать название
 # if author=='Булгаков М.А.' то выводим 100 if author=='Есенин С.А.' то выводим 200 else price
 SELECT author, title,
      IF(author='Булгаков М.А.', 100, IF(author='Есенин С.А.', 200, price)) AS new_price  FROM book

 +------------------+-----------------------+-----------+
 | author           | title                 | new_price |
 +------------------+-----------------------+-----------+
 | Булгаков М.А.    | Мастер и Маргарита    | 100       |
 | Булгаков М.А.    | Белая гвардия         | 100       |
 | Достоевский Ф.М. | Идиот                 | 460.00    |
 | Достоевский Ф.М. | Братья Карамазовы     | 799.01    |
 | Есенин С.А.      | Стихотворения и поэмы | 200       |
 +------------------+-----------------------+-----------+


 # Округление с условиями
 SELECT author, title,
     ROUND(IF(author='Булгаков М.А.', price+price*0.10, IF(author='Есенин С.А.', price+price*0.05, price)), 2)
      AS new_price  FROM book

 # Тоже самое
 select author, title,
 round(case author
     when "Булгаков М.А." then price * 1.1
     when "Есенин С.А." then price * 1.05
     else price end, 2) as new_price
 from book

 +------------------+-----------------------+-----------+
 | author           | title                 | new_price |
 +------------------+-----------------------+-----------+
 | Булгаков М.А.    | Мастер и Маргарита    | 738.09    |
 | Булгаков М.А.    | Белая гвардия         | 594.55    |
 | Достоевский Ф.М. | Идиот                 | 460.00    |
 | Достоевский Ф.М. | Братья Карамазовы     | 799.01    |
 | Есенин С.А.      | Стихотворения и поэмы | 682.50    |
 +------------------+-----------------------+-----------+


 # Вывести автора, название  и цены тех книг, количество которых меньше 10.
 SELECT author, title, price FROM book
     where amount < 10

 +------------------+--------------------+--------+
 | author           | title              | price  |
 +------------------+--------------------+--------+
 | Булгаков М.А.    | Мастер и Маргарита | 670.99 |
 | Булгаков М.А.    | Белая гвардия      | 540.50 |
 | Достоевский Ф.М. | Братья Карамазовы  | 799.01 |
 +------------------+--------------------+--------+


 # Вывести название, автора,  цену  и количество всех книг, цена которых меньше 500 или больше 600, а стоимость всех
 экземпляров этих книг больше или равна 5000.
 select title, author, price, amount from book
     where (author < 500 or author > 600) and price * amount >= 5000

 # Тоже самое
 select title, author, price, amount from book
     where (author < 500 || author > 600) && price * amount >= 5000

 +-----------------------+-------------+--------+--------+
 | title                 | author      | price  | amount |
 +-----------------------+-------------+--------+--------+
 | Стихотворения и поэмы | Есенин С.А. | 650.00 | 15     |
 +-----------------------+-------------+--------+--------+


 # Выбрать названия и количества тех книг, количество которых от 5 до 14 включительно.

 # Тоже самое                           # Тоже самое
 SELECT title, amount                   SELECT title, amount
 FROM book                              FROM book
 WHERE amount BETWEEN 5 AND 14;         WHERE amount >= 5 AND amount <=14;

 +---------------+--------+
 | title         | amount |
 +---------------+--------+
 | Белая гвардия | 5      |
 | Идиот         | 10     |
 +---------------+--------+


 # Вывести название и авторов тех книг, цены которых принадлежат интервалу от 540.50 до 800 (включая границы),
 а количество или 2, или 3, или 5, или 7 .

 # BETWEEN в диапазоне аналог range включая его границы
 select title, author from book
     where price between 540.50 and 800 and amount in (2, 3, 5, 7)

  # IN и BETWEEN выполняются раньше and, поэтому скобки писать не обязательно
 select title, author from book
    where price (between 540.50 and 800) and (amount in (2, 3, 5, 7));

 +--------------------+------------------+
 | title              | author           |
 +--------------------+------------------+
 | Мастер и Маргарита | Булгаков М.А.    |
 | Белая гвардия      | Булгаков М.А.    |
 | Братья Карамазовы  | Достоевский Ф.М. |
 +--------------------+------------------+


 # Вывести  автора и название  книг, количество которых принадлежит интервалу от 2 до 14 (включая границы). Информацию
 отсортировать сначала по авторам (в обратном алфавитном порядке), а затем по названиям книг (по алфавиту).

 # ASC - (по возрастанию),  DESC - (по убыванию)
 select author, title from book
    where amount between 2 and 14
    ORDER BY author DESC, title asc;

 +------------------+--------------------+
 | author           | title              |
 +------------------+--------------------+
 | Достоевский Ф.М. | Братья Карамазовы  |
 | Достоевский Ф.М. | Идиот              |
 | Булгаков М.А.    | Белая гвардия      |
 | Булгаков М.А.    | Мастер и Маргарита |
 +------------------+--------------------+
________________________________________________________________________________________________________________________


 # Исходная таблица
 +---------+-----------------------+------------------+--------+--------+
 | book_id | title                 | author           | price  | amount |
 +---------+-----------------------+------------------+--------+--------+
 | 1       | Мастер и Маргарита    | Булгаков М.А.    | 670.99 | 3      |
 | 2       | Белая гвардия         | Булгаков М.А.    | 540.50 | 5      |
 | 3       | Идиот                 | Достоевский Ф.М. | 460.00 | 10     |
 | 4       | Братья Карамазовы     | Достоевский Ф.М. | 799.01 | 2      |
 | 5       | Стихотворения и поэмы | Есенин С.А.      | 650.00 | 15     |
 | 6       |                       | Иванов С.С.      | 50.00  | 10     |
 | 7       | Дети полуночи         | Рушди Салман     | 950.00 | 5      |
 | 8       | Лирика                | Гумилев Н.С.     | 460.00 | 10     |
 | 9       | Поэмы                 | Бехтерев С.С.    | 460.00 | 10     |
 | 10      | Капитанская дочка     | Пушкин А.С.      | 520.50 | 7      |
 +---------+-----------------------+------------------+--------+--------+


 # Вывести название и автора тех книг, название которых состоит из двух и более слов, а инициалы автора содержат букву
 «С». Считать, что в названии слова отделяются друг от друга пробелами и не содержат знаков препинания, между фамилией
 автора и инициалами обязателен пробел, инициалы записываются без пробела в формате: буква, точка, буква, точка.
 Информацию отсортировать по названию книги в алфавитном порядке.

 LIKE 'a%'     Находит любые значения, которые начинаются с "a"
 LIKE '%a'     Находит любые значения, которые заканчиваются на "a"
 LIKE '%aa%'   Находит любые значения, которые имеют "or" в любой позиции
 LIKE '_r%'    Находит любые значения, имеющие букву "r" во второй позиции
 LIKE 'a__%'   Находит любые значения, начинающиеся с буквы "a" и имеющие длину не менее 3 символов
 LIKE 'a%o'    Находит любые значения, которые начинаются с "a" и заканчиваются "о"


 select title, author from book
   WHERE title like '% %' and title not like ' %' and (author like '%______ С___' or author like '%______ __С_')
   # Тоже самое но с REGEXP
   WHERE title REGEXP '(.+ .+)+' and  author REGEXP '(.+ С.А.)|(.+ А.С.)'


 # _ В like значит 1 любой символ

 +-----------------------+-------------+
 | title                 | author      |
 +-----------------------+-------------+
 | Капитанская дочка     | Пушкин А.С. |
 | Стихотворения и поэмы | Есенин С.А. |
 +-----------------------+-------------+
________________________________________________________________________________________________________________________


 # Исходная таблица
 +---------+-----------------------+------------------+--------+--------+
 | book_id | title                 | author           | price  | amount |
 +---------+-----------------------+------------------+--------+--------+
 | 1       | Мастер и Маргарита    | Булгаков М.А.    | 670.99 | 3      |
 | 2       | Белая гвардия         | Булгаков М.А.    | 540.50 | 5      |
 | 3       | Идиот                 | Достоевский Ф.М. | 460.00 | 10     |
 | 4       | Братья Карамазовы     | Достоевский Ф.М. | 799.01 | 3      |
 | 5       | Игрок                 | Достоевский Ф.М. | 480.50 | 10     |
 | 6       | Стихотворения и поэмы | Есенин С.А.      | 650.00 | 15     |
 +---------+-----------------------+------------------+--------+--------+


 # Выбор уникальных элементов столбца  DISTINCT                                                                 <-----
 На самом деле это тяжёлая операция - группировка и сортировку в себя включает, на маленьких объёмах это незаметно,
 а вот на больших его лучше не использовать

 # Отобрать различные (уникальные) элементы столбца amount таблицы book.

 select distinct amount from book

 +--------+
 | amount |
 +--------+
 | 3      |
 | 5      |
 | 10     |
 | 15     |
 +--------+


 # Тоже самое но установить LIMIT

 select distinct amount from book
 limit 1

 +--------+
 | amount |
 +--------+
 | 3      |
 +--------+


 # Выборка данных, групповые функции SUM и COUNT   в GROUP BY попадает столбец без функции
 Важно! В разделе GROUP BY нужно перечислять все НЕАГРЕГИРОВАННЫЕ столбцы (к которым не применяются групповые функции) из SELECT.

 SELECT author, sum(amount), count(amount)
 FROM book
 GROUP BY author;

 +------------------+-------------+---------------+
 | author           | sum(amount) | count(amount) |
 +------------------+-------------+---------------+
 | Булгаков М.А.    | 8           | 2             |
 | Достоевский Ф.М. | 23          | 3             |
 | Есенин С.А.      | 15          | 1             |
 +------------------+-------------+---------------+


 select author as Автор, count(author) as Различных_книг, sum(amount) as Количество_экземпляров from book
     GROUP BY Автор

 +------------------+----------------+------------------------+
 | Автор            | Различных_книг | Количество_экземпляров |
 +------------------+----------------+------------------------+
 | Булгаков М.А.    | 2              | 8                      |
 | Достоевский Ф.М. | 3              | 23                     |
 | Есенин С.А.      | 1              | 15                     |
 +------------------+----------------+------------------------+


 # посчитать уникальные наименования
 SELECT
     author,
     COUNT(DISTINCT title)
 FROM book
 GROUP BY author;

 +------------------+-----------------------+
 | author           | COUNT(DISTINCT title) |
 +------------------+-----------------------+
 | Булгаков М.А.    | 2                     |
 | Достоевский Ф.М. | 3                     |
 | Есенин С.А.      | 1                     |
 +------------------+-----------------------+


 # Выборка данных, групповые функции MIN, MAX и AVG

 SELECT author, MIN(price) AS Минимальная_цена, MAX(price) AS Максимальная_цена, AVG(price) AS Средняя_цена
 FROM book
 GROUP BY author;

 +------------------+------------------+-------------------+--------------+
 | author           | Минимальная_цена | Максимальная_цена | Средняя_цена |
 +------------------+------------------+-------------------+--------------+
 | Булгаков М.А.    | 540.50           | 670.99            | 605.745000   |
 | Достоевский Ф.М. | 460.00           | 799.01            | 579.836667   |
 | Есенин С.А.      | 650.00           | 650.00            | 650.000000   |
 +------------------+------------------+-------------------+--------------+


 # Выборка данных c вычислением, групповые функции
 SELECT MIN(price) AS Минимальная_цена, MAX(price) AS Максимальная_цена, ROUND(AVG(price), 2) AS Средняя_цена
 FROM book

 +------------------+-------------------+--------------+
 | Минимальная_цена | Максимальная_цена | Средняя_цена |
 +------------------+-------------------+--------------+
 | 460.00           | 799.01            | 600.17       |
 +------------------+-------------------+--------------+


 # Вычислить среднюю цену и суммарную стоимость тех книг, количество экземпляров которых принадлежит интервалу
 от 5 до 14, включительно. Столбцы назвать Средняя_цена и Стоимость, значения округлить до 2-х знаков после запятой.

 SELECT
     ROUND(AVG(price), 2) as Средняя_цена,
     ROUND(SUM(price * amount), 2) as Стоимость     # Внимание на запятую она тут не нужна
 FROM book
 where amount BETWEEN 5 AND 14

 +--------------+-----------+
 | Средняя_цена | Стоимость |
 +--------------+-----------+
 | 493.67       | 12107.50  |
 +--------------+-----------+


 # Пример
 SELECT author,
     MIN(price) AS Минимальная_цена,
     MAX(price) AS Максимальная_цена               # Внимание на запятую она тут не нужна
 FROM book
 GROUP BY author
 HAVING SUM(price * amount) > 5000;

 +------------------+------------------+-------------------+
 | author           | Минимальная_цена | Максимальная_цена |
 +------------------+------------------+-------------------+
 | Достоевский Ф.М. | 460.00           | 799.01            |
 | Есенин С.А.      | 650.00           | 650.00            |
 +------------------+------------------+-------------------+


 # Посчитать стоимость всех экземпляров каждого автора без учета книг «Идиот» и «Белая гвардия».
 В результат включить только тех авторов, у которых суммарная стоимость книг (без учета книг «Идиот» и «Белая гвардия»)
 более 5000 руб. Вычисляемый столбец назвать Стоимость. Результат отсортировать по убыванию стоимости.

 <>  то же самое что и !=

 # Тоже самое                                              # Тоже самое
 SELECT author,                                            SELECT author,
     SUM(price*amount) AS Стоимость                            SUM(price*amount) AS Стоимость
 FROM book                                                 FROM book
 WHERE title != 'Идиот' and title != 'Белая гвардия'       WHERE title <> 'Идиот' and title <> 'Белая гвардия'
 GROUP BY author                                           GROUP BY author
 HAVING SUM(price*amount) > 5000                           HAVING Стоимость > 5000
 order by Стоимость desc                                   order by Стоимость desc

 # Тоже самое Но лучше конечно not in
 select author, sum(price*amount) as Стоимость
 from book
 where title not in ('Идиот', 'Белая гвардия')
 group by author
 having Стоимость > 5000
 order by Стоимость desc

 +------------------+-----------+
 | author           | Стоимость |
 +------------------+-----------+
 | Есенин С.А.      | 9750.00   |
 | Достоевский Ф.М. | 7202.03   |
 +------------------+-----------+


 # Вложенный запрос, возвращающий одно значение

 SELECT title, author, price, amount
 FROM book
 WHERE price = (
          SELECT MIN(price)
          FROM book
       );                                               # ; Означает конец выражения

 +-------+------------------+--------+--------+
 | title | author           | price  | amount |
 +-------+------------------+--------+--------+
 | Идиот | Достоевский Ф.М. | 460.00 | 10     |
 +-------+------------------+--------+--------+


 # Вывести информацию (автора, название и цену) о  книгах, цены которых меньше или равны средней цене книг на складе.
 Информацию вывести в отсортированном по убыванию цены виде. Среднее вычислить как среднее по цене книги.

 SELECT author, title, price
 FROM book
 WHERE price <= (
          SELECT avg(price)
          FROM book
       )
 order by price desc

 +------------------+---------------+--------+
 | author           | title         | price  |
 +------------------+---------------+--------+
 | Булгаков М.А.    | Белая гвардия | 540.50 |
 | Достоевский Ф.М. | Игрок         | 480.50 |
 | Достоевский Ф.М. | Идиот         | 460.00 |
 +------------------+---------------+--------+


 # Использование вложенного запроса в выражении

 # То есть нужно вывести и те книги, количество экземпляров которых меньше среднего на 3, или больше среднего на 3.
 SELECT title, author, amount
 FROM book
 WHERE ABS(amount - (SELECT AVG(amount) FROM book)) > 3;

 +-----------------------+------------------+--------+
 | title                 | author           | amount |
 +-----------------------+------------------+--------+
 | Мастер и Маргарита    | Булгаков М.А.    | 3      |
 | Братья Карамазовы     | Достоевский Ф.М. | 3      |
 | Стихотворения и поэмы | Есенин С.А.      | 15     |
 +-----------------------+------------------+--------+


 # Вывести информацию (автора, название и цену) о тех книгах, цены которых превышают минимальную цену книги на складе
 не более чем на 150 рублей в отсортированном по возрастанию цены виде.

 SELECT author, title, price
 FROM book
 WHERE (price - (SELECT min(price) FROM book)) <= 150
 order by price

 +------------------+----------------+--------+
 | author           | title          | price  |
 +------------------+----------------+--------+
 | Достоевский Ф.М. | Идиот          | 460.00 |
 | Достоевский Ф.М. | Игрок          | 480.50 |
 | Булгаков М.А.    | Белая гвардия  | 540.50 |
 | Пушкин А.С.      | Евгений Онегин | 610.00 |
 +------------------+----------------+--------+


 # Вывести информацию (автора, книгу и количество) о тех книгах, количество экземпляров которых в таблице book не дублируется.
 SELECT author, title, amount
 FROM book
 WHERE amount NOT IN (
         SELECT amount
         FROM book
         GROUP BY amount
         HAVING COUNT(amount) != 1
       )

 +---------------+-----------------------+--------+
 | author        | title                 | amount |
 +---------------+-----------------------+--------+
 | Булгаков М.А. | Белая гвардия         | 5      |
 | Есенин С.А.   | Стихотворения и поэмы | 15     |
 +---------------+-----------------------+--------+


 # Вложенный запрос, операторы ANY и ALL

 SELECT title, author, amount, price
 FROM book
 WHERE amount < ALL (
         SELECT AVG(amount)
         FROM book
         GROUP BY author
       );

 +--------------------+------------------+--------+--------+
 | title              | author           | amount | price  |
 +--------------------+------------------+--------+--------+
 | Мастер и Маргарита | Булгаков М.А.    | 3      | 670.99 |
 | Братья Карамазовы  | Достоевский Ф.М. | 3      | 799.01 |
 +--------------------+------------------+--------+--------+
________________________________________________________________________________________________________________________

 # Таблица book
 +---------+-----------------------+------------------+--------+--------+
 | book_id | title                 | author           | price  | amount |
 +---------+-----------------------+------------------+--------+--------+
 | 1       | Мастер и Маргарита    | Булгаков М.А.    | 670.99 | 3      |
 | 2       | Белая гвардия         | Булгаков М.А.    | 540.50 | 5      |
 | 3       | Идиот                 | Достоевский Ф.М. | 460.00 | 10     |
 | 4       | Братья Карамазовы     | Достоевский Ф.М. | 799.01 | 2      |
 | 5       | Стихотворения и поэмы | Есенин С.А.      | 650.00 | 15     |
 +---------+-----------------------+------------------+--------+--------+

  # Таблица supply
 +-----------+----------------+------------------+--------+--------+
 | supply_id | title          | author           | price  | amount |
 +-----------+----------------+------------------+--------+--------+
 | 1         | Лирика         | Пастернак Б.Л.   | 518.99 | 2      |
 | 2         | Черный человек | Есенин С.А.      | 570.20 | 6      |
 | 3         | Белая гвардия  | Булгаков М.А.    | 540.50 | 7      |
 | 4         | Идиот          | Достоевский Ф.М. | 360.80 | 3      |
 +-----------+----------------+------------------+--------+--------+

 # Занести из таблицы supply в таблицу book только те книги, авторов которых нет в  book.


 INSERT INTO book (title, author, price, amount)
 SELECT title, author, price, amount
 FROM supply
 WHERE author NOT IN (SELECT DISTINCT author
         FROM book);

 SELECT * FROM book;

 +---------+-----------------------+------------------+--------+--------+
 | book_id | title                 | author           | price  | amount |
 +---------+-----------------------+------------------+--------+--------+
 | 1       | Мастер и Маргарита    | Булгаков М.А.    | 670.99 | 3      |
 | 2       | Белая гвардия         | Булгаков М.А.    | 540.50 | 5      |
 | 3       | Идиот                 | Достоевский Ф.М. | 460.00 | 10     |
 | 4       | Братья Карамазовы     | Достоевский Ф.М. | 799.01 | 2      |
 | 5       | Стихотворения и поэмы | Есенин С.А.      | 650.00 | 15     |
 | 6       | Лирика                | Пастернак Б.Л.   | 518.99 | 2      |
 +---------+-----------------------+------------------+--------+--------+


 # Обновить Таблицу
 UPDATE fine tv
 SET tv.sum_fine = (
     SELECT v.sum_fine
     FROM traffic_violation v
     WHERE v.violation = tv.violation
 )
 WHERE tv.sum_fine IS NULL;











 # Выберите из таблицы game_events только те события, которые произошли 15 января 2021 года или позднее.
 # В выводе получите только один столбец - уникальные названия этих событий.

 select distinct event_name from game_events
 where event_date >= '2021-01-15'


 # *Агрегирующие функции (иногда их ещё называют агрегатными) обрабатывают набор строк для подсчета и возвращают одно
 #обобщенное значение.

 # Такой запрос всегда вернет только одно значение – количество строк в таблице, которая указана во FROM.

 SELECT COUNT(*)
 FROM game_events


 # как посчитать количество уникальных пользователей за каждый день.

 SELECT event_date, COUNT(DISTINCT user_id)
 FROM game_events
 GROUP BY event_date


 # Найти дату первого и последнего игрового события для каждого игрока.

 select user_id, min(event_date), max(event_date) from game_events
 group by user_id


Копирую решение уже в который раз...
































































































































































































































































































































































































"""