"""

 # Исходная таблица
 +---------+-----------------------+------------------+--------+--------+
 | book_id | title                 | author           | price  | amount |
 +---------+-----------------------+------------------+--------+--------+
 | 1       | Мастер и Маргарита    | Булгаков М.А.    | 670.99 | 3      |
 | 2       | Белая гвардия         | Булгаков М.А.    | 540.50 | 5      |
 | 3       | Идиот                 | Достоевский Ф.М. | 460.00 | 10     |
 | 4       | Братья Карамазовы     | Достоевский Ф.М. | 799.01 | 2      |
 | 5       | Стихотворения и поэмы | Есенин С.А.      | 650.00 | 15     |
 +---------+-----------------------+------------------+--------+--------+


 # Мы выбираем столбцы title, author, amount из Таблицы book
 SELECT title, author, amount  FROM book
 # Тоже самое
 SELECT (title), (author), (amount)  FROM book

 +-----------------------+------------------+--------+
 | title                 | author           | amount |
 +-----------------------+------------------+--------+
 | Мастер и Маргарита    | Булгаков М.А.    | 3      |
 | Белая гвардия         | Булгаков М.А.    | 5      |
 | Идиот                 | Достоевский Ф.М. | 10     |
 | Братья Карамазовы     | Достоевский Ф.М. | 2      |
 | Стихотворения и поэмы | Есенин С.А.      | 15     |
 +-----------------------+------------------+--------+


 # if author=='Булгаков М.А.' то выводим 100 if author=='Есенин С.А.' то выводим 200 else price
 SELECT author, title,
      IF(author='Булгаков М.А.', 100, IF(author='Есенин С.А.', 200, price)) AS new_price  FROM book

 +------------------+-----------------------+-----------+
 | author           | title                 | new_price |
 +------------------+-----------------------+-----------+
 | Булгаков М.А.    | Мастер и Маргарита    | 100       |
 | Булгаков М.А.    | Белая гвардия         | 100       |
 | Достоевский Ф.М. | Идиот                 | 460.00    |
 | Достоевский Ф.М. | Братья Карамазовы     | 799.01    |
 | Есенин С.А.      | Стихотворения и поэмы | 200       |
 +------------------+-----------------------+-----------+


 # Округление с условиями
 SELECT author, title,
     ROUND(IF(author='Булгаков М.А.', price+price*0.10, IF(author='Есенин С.А.', price+price*0.05, price)), 2)
      AS new_price  FROM book

 # Тоже самое
 select author, title,
 round(case author
     when "Булгаков М.А." then price * 1.1
     when "Есенин С.А." then price * 1.05
     else price end, 2) as new_price
 from book

 +------------------+-----------------------+-----------+
 | author           | title                 | new_price |
 +------------------+-----------------------+-----------+
 | Булгаков М.А.    | Мастер и Маргарита    | 738.09    |
 | Булгаков М.А.    | Белая гвардия         | 594.55    |
 | Достоевский Ф.М. | Идиот                 | 460.00    |
 | Достоевский Ф.М. | Братья Карамазовы     | 799.01    |
 | Есенин С.А.      | Стихотворения и поэмы | 682.50    |
 +------------------+-----------------------+-----------+


 # Вывести автора, название  и цены тех книг, количество которых меньше 10.
 SELECT author, title, price FROM book
     where amount < 10

 +------------------+--------------------+--------+
 | author           | title              | price  |
 +------------------+--------------------+--------+
 | Булгаков М.А.    | Мастер и Маргарита | 670.99 |
 | Булгаков М.А.    | Белая гвардия      | 540.50 |
 | Достоевский Ф.М. | Братья Карамазовы  | 799.01 |
 +------------------+--------------------+--------+


 # Вывести название, автора,  цену  и количество всех книг, цена которых меньше 500 или больше 600, а стоимость всех
 экземпляров этих книг больше или равна 5000.
 select title, author, price, amount from book
     where (author < 500 or author > 600) and price * amount >= 5000

 # Тоже самое
 select title, author, price, amount from book
     where (author < 500 || author > 600) && price * amount >= 5000

 +-----------------------+-------------+--------+--------+
 | title                 | author      | price  | amount |
 +-----------------------+-------------+--------+--------+
 | Стихотворения и поэмы | Есенин С.А. | 650.00 | 15     |
 +-----------------------+-------------+--------+--------+


 # Вывести название и авторов тех книг, цены которых принадлежат интервалу от 540.50 до 800 (включая границы),
 а количество или 2, или 3, или 5, или 7 .

 select title, author from book
     where price between 540.50 and 800 and amount in (2, 3, 5, 7)

  # IN и BETWEEN выполняются раньше and, поэтому скобки писать не обязательно
 select title, author from book
    where price (between 540.50 and 800) and (amount in (2, 3, 5, 7));

 +--------------------+------------------+
 | title              | author           |
 +--------------------+------------------+
 | Мастер и Маргарита | Булгаков М.А.    |
 | Белая гвардия      | Булгаков М.А.    |
 | Братья Карамазовы  | Достоевский Ф.М. |
 +--------------------+------------------+


 # Вывести  автора и название  книг, количество которых принадлежит интервалу от 2 до 14 (включая границы). Информацию
 отсортировать сначала по авторам (в обратном алфавитном порядке), а затем по названиям книг (по алфавиту).

 # ASC - (по возрастанию),  DESC - (по убыванию)
 select author, title from book
    where amount between 2 and 14
    ORDER BY author DESC, title asc;

 +------------------+--------------------+
 | author           | title              |
 +------------------+--------------------+
 | Достоевский Ф.М. | Братья Карамазовы  |
 | Достоевский Ф.М. | Идиот              |
 | Булгаков М.А.    | Белая гвардия      |
 | Булгаков М.А.    | Мастер и Маргарита |
 +------------------+--------------------+
________________________________________________________________________________________________________________________


 # Исходная таблица
 +---------+-----------------------+------------------+--------+--------+
 | book_id | title                 | author           | price  | amount |
 +---------+-----------------------+------------------+--------+--------+
 | 1       | Мастер и Маргарита    | Булгаков М.А.    | 670.99 | 3      |
 | 2       | Белая гвардия         | Булгаков М.А.    | 540.50 | 5      |
 | 3       | Идиот                 | Достоевский Ф.М. | 460.00 | 10     |
 | 4       | Братья Карамазовы     | Достоевский Ф.М. | 799.01 | 2      |
 | 5       | Стихотворения и поэмы | Есенин С.А.      | 650.00 | 15     |
 | 6       |                       | Иванов С.С.      | 50.00  | 10     |
 | 7       | Дети полуночи         | Рушди Салман     | 950.00 | 5      |
 | 8       | Лирика                | Гумилев Н.С.     | 460.00 | 10     |
 | 9       | Поэмы                 | Бехтерев С.С.    | 460.00 | 10     |
 | 10      | Капитанская дочка     | Пушкин А.С.      | 520.50 | 7      |
 +---------+-----------------------+------------------+--------+--------+


 # Вывести название и автора тех книг, название которых состоит из двух и более слов, а инициалы автора содержат букву
 «С». Считать, что в названии слова отделяются друг от друга пробелами и не содержат знаков препинания, между фамилией
 автора и инициалами обязателен пробел, инициалы записываются без пробела в формате: буква, точка, буква, точка.
 Информацию отсортировать по названию книги в алфавитном порядке.

 select title, author from book
   WHERE title like '% %' and title not like ' %' and (author like '%______ С___' or author like '%______ __С_')

 # _ В like значит 1 любой символ

 +-----------------------+-------------+
 | title                 | author      |
 +-----------------------+-------------+
 | Капитанская дочка     | Пушкин А.С. |
 | Стихотворения и поэмы | Есенин С.А. |
 +-----------------------+-------------+



"""